In [1]:
import pandas as pd

In [2]:
df1 = pd.DataFrame({'a': ['a0', 'a1', 'a2', 'a3'],
                    'b': ['b0', 'b1', 'b2', 'b3'],
                    'c': ['c0', 'c1', 'c2', 'c3']},
                    index=[0, 1, 2, 3])
 
df2 = pd.DataFrame({'a': ['a2', 'a3', 'a4', 'a5'],
                    'b': ['b2', 'b3', 'b4', 'b5'],
                    'c': ['c2', 'c3', 'c4', 'c5'],
                    'd': ['d2', 'd3', 'd4', 'd5']},
                    index=[2, 3, 4, 5])

In [3]:
df1

    a   b   c
0  a0  b0  c0
1  a1  b1  c1
2  a2  b2  c2
3  a3  b3  c3

In [4]:
df2

    a   b   c   d
2  a2  b2  c2  d2
3  a3  b3  c3  d3
4  a4  b4  c4  d4
5  a5  b5  c5  d5

In [5]:
result1=pd.concat([df1,df2])

In [6]:
result1

    a   b   c    d
0  a0  b0  c0  NaN
1  a1  b1  c1  NaN
2  a2  b2  c2  NaN
3  a3  b3  c3  NaN
2  a2  b2  c2   d2
3  a3  b3  c3   d3
4  a4  b4  c4   d4
5  a5  b5  c5   d5

In [7]:
result2=pd.concat([df1,df2],ignore_index=True)

In [8]:
result2

    a   b   c    d
0  a0  b0  c0  NaN
1  a1  b1  c1  NaN
2  a2  b2  c2  NaN
3  a3  b3  c3  NaN
4  a2  b2  c2   d2
5  a3  b3  c3   d3
6  a4  b4  c4   d4
7  a5  b5  c5   d5

In [9]:
result3=pd.concat([df1,df2],axis=1)

In [10]:
result3

     a    b    c    a    b    c    d
0   a0   b0   c0  NaN  NaN  NaN  NaN
1   a1   b1   c1  NaN  NaN  NaN  NaN
2   a2   b2   c2   a2   b2   c2   d2
3   a3   b3   c3   a3   b3   c3   d3
4  NaN  NaN  NaN   a4   b4   c4   d4
5  NaN  NaN  NaN   a5   b5   c5   d5

In [13]:
result3_in=pd.concat([df1,df2],axis=1,join='inner')

In [14]:
result3_in

    a   b   c   a   b   c   d
2  a2  b2  c2  a2  b2  c2  d2
3  a3  b3  c3  a3  b3  c3  d3

In [15]:
sr1 = pd.Series(['e0', 'e1', 'e2', 'e3'], name='e')
sr2 = pd.Series(['f0', 'f1', 'f2'], name='f', index=[3, 4, 5])
sr3 = pd.Series(['g0', 'g1', 'g2', 'g3'], name='g')

In [16]:
sr1

0    e0
1    e1
2    e2
3    e3
Name: e, dtype: object

In [17]:
sr2

3    f0
4    f1
5    f2
Name: f, dtype: object

In [18]:
sr3

0    g0
1    g1
2    g2
3    g3
Name: g, dtype: object

In [19]:
df1

    a   b   c
0  a0  b0  c0
1  a1  b1  c1
2  a2  b2  c2
3  a3  b3  c3

In [20]:
result4=pd.concat([df1,sr1],axis=1)

In [21]:
result4

    a   b   c   e
0  a0  b0  c0  e0
1  a1  b1  c1  e1
2  a2  b2  c2  e2
3  a3  b3  c3  e3

In [22]:
df2

    a   b   c   d
2  a2  b2  c2  d2
3  a3  b3  c3  d3
4  a4  b4  c4  d4
5  a5  b5  c5  d5

In [25]:
sr2

3    f0
4    f1
5    f2
Name: f, dtype: object

In [23]:
result5=pd.concat([df2,sr2],axis=1,sort=True)

In [24]:
result5

    a   b   c   d    f
2  a2  b2  c2  d2  NaN
3  a3  b3  c3  d3   f0
4  a4  b4  c4  d4   f1
5  a5  b5  c5  d5   f2

In [26]:
sr1

0    e0
1    e1
2    e2
3    e3
Name: e, dtype: object

In [27]:
sr3

0    g0
1    g1
2    g2
3    g3
Name: g, dtype: object

In [28]:
result6=pd.concat([sr1,sr3],axis=1)

In [29]:
result6

    e   g
0  e0  g0
1  e1  g1
2  e2  g2
3  e3  g3

In [30]:
type(result6)

pandas.core.frame.DataFrame

In [35]:
result7=pd.concat([sr1,sr3],axis=0)

In [36]:
result7

0    e0
1    e1
2    e2
3    e3
0    g0
1    g1
2    g2
3    g3
dtype: object

In [37]:
type(result7)

pandas.core.series.Series